database/seeders/PostSeeder.php

INSERT INTO `posts` (`title`, `description`, `meta_description`, `image`, `created_at`, `updated_at`) VALUES ('Molestias eveniet excepturi sit suscipit dolores nesciunt voluptas.', 'Accusamus nesciunt libero eum doloribus voluptatem ut. Fuga magni natus explicabo. Hic dolore aliquam excepturi itaque provident consequuntur a. Cumque corporis aperiam explicabo repellat.', 'Non et sequi eligendi fuga voluptas. At consectetur aut iste fugit enim. Et atque nisi dolorem aliquid et sunt. Quaerat sit sequi officiis rem ex.', 'https://via.placeholder.com/640x480.png/005599?text=omnis', '2024-11-18 22:59:15', '2024-11-18 22:59:15')
---
    public function run()
    {
        Post::factory()->withTranslations()->count(1)->create();