app/Http/Controllers/PostController.php

    public function index(Request $request)
    {
        $local = $request->get('local', app()->getLocale());
        $keyWord = 'title';

        $posts = Post::searchByTranslation('title', $keyWord, $local)->paginate(10);
---
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `posts`

    public function show($id)
    {
        $post = Post::findOrFail($id);
---
SELECT * FROM `posts` WHERE `posts`.`id` = 'index' LIMIT 1

    public function store(Request $request)
    {
        $validated = $request->validate([
            'title' => 'required|array',
            'title.en' => 'required|string|max:255',
            'title.ar' => 'required|string|max:255',
            'description' => 'required|array',
            'description.en' => 'required|string',
            'description.ar' => 'required|string',
            'meta_description' => 'nullable|string',
            'image' => 'nullable|string',
        ]);

        $post = Post::create($validated);
---
INSERT INTO `posts` (`title`, `description`, `meta_description`, `updated_at`, `created_at`) VALUES ('test add english title', 'test add english title', 'test add english title', '2024-11-22 00:20:58', '2024-11-22 00:20:58')